class Solution(object):
    def integerBreak(self, n):
        """
        :type n: int
        :rtype: int
        """
        # 1 ≤ 𝑗 < 𝑖，需要遍历𝑗 得到𝑑𝑝[𝑖] 的最大值，则状态转移方程如下：
        # 𝑑𝑝[𝑖] = 𝑚𝑎𝑥1≤𝑗<𝑖{𝑚𝑎𝑥(𝑗 × (𝑖 − 𝑗), 𝑗 × 𝑑𝑝[𝑖 − 𝑗])}。
        ans = 0
        dp = [0]*(n+1)
        ans = 0
        for i in range(2,n+1):
            for j in range(i):
                dp[i] = max(
                    dp[i],          # 之前 j 算過的最好結果
                    j * (i - j),    # 右邊不拆
                    j * dp[i - j]   # 右邊繼續拆
                )
        return dp[n]

        